app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2017-11-27 22:41:17.681884"], ["updated_at", "2017-11-27 22:41:17.681884"]]
---
  def create
    @post = Post.create(title: params[:post][:title], description: params[:post][:description])